import {SapareImgSet4} from '../SliderSection/SapareImages4'

export const sapareHighlight4 = {
    slides: SapareImgSet4,

    chatDesc:
    `원하는 상품의 상품 조회 화면으로 이동하여 채팅하기 버튼을 누르면 오른쪽 하단에
    채팅 모달창이 띄워집니다. 로그인을 할 경우 자동으로 회원의 고유정보를 채팅 서버에
    넘겨줌으로써 구매자와 판매자의 개인 채팅룸을 생성하기 위하여 판매자의 정보만 데이터베이스에서
    가져옵니다. 구매자와 판매자는 서로 채팅을 할 수 있으며 구매자가 '채팅하기' 버튼을 누르고 채팅 메시지를
    판매자에게 보내면 판매자는 해당하는 상품 조회 페이지에서 '구매자 선택' 버튼을 누르고 현재
    본인에게 채팅 메시지를 보낸 모든 구매자들의 닉네임을 볼 수 있습니다. 판매자는 원하는 구매자를 선택하고
    거래결정을 확인하면 거래가 성사되게 됩니다.`,
}